       dcl-s  break_in     varchar(16);
       dcl-c  PASSWORD     'my_password'
       dcl-ds my_ds        likeds(my_ds_t);
       dcl-s  my_other_var int(20);
       dcl-ds my_other_ds  qualified;
         foo int(10);
         barbaz ind;
       end-ds;
